Revit 2027 API
ParameterTypeId.RbsCtcServiceType Property
 "Service Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsCtcServiceType { get; }
Public Shared ReadOnly Property RbsCtcServiceType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsCtcServiceType {
	ForgeTypeId^ get ();
}
static member RbsCtcServiceType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace